In [1]:
import pandas as pd
import os

data_path = "../../TwitterEgo/data/"

In [2]:
df = pd.read_csv(data_path+"reaction_sample.csv")

In [3]:
df

          user_id             tweet_id  class
0        53870594   185015205342883840      1
1       221904904   898376303170158592      1
2       221904904   847519818022477824      1
3       221904904   844239843412578304      1
4       221904904   842429765218893824      1
...           ...                  ...    ...
183279   15790496  1033049288564195329      1
183280   15790496  1032346876820037637      1
183281   15790496  1002358835649052673      1
183282   15790496   998157460954386432      1
183283   15790496   996385947330777088      1

[183284 rows x 3 columns]

In [4]:
df['tweet_id'].nunique()

177558

In [5]:
df['user_id'].nunique()

10419

In [6]:
lol = df.values.tolist()
len(lol)

183284

In [7]:
users = list(set(df['user_id']))
tweets = list(set(df['tweet_id']))

In [8]:
len(users),len(tweets)

(10419, 177558)

In [9]:
k = []
for i in range(0,len(users)//100):
    for j in range(0,len(tweets)//100):
        if [users[i],tweets[j],1] not in lol and [users[i],tweets[j],0] not in k:
            k.append([users[i],tweets[j],0])

In [10]:
len(k)

184584

In [11]:
d = lol+k

In [12]:
len(d)

367868

In [13]:
d = sorted(d, key=lambda x: x[0])

In [14]:
new_df = pd.DataFrame(d, columns = ['user_id','tweet_id','did_react'])

In [15]:
new_df

          user_id             tweet_id  did_react
0              12  1230617320436965384          1
1              12  1230600033721962501          1
2              12  1230597477268475905          1
3              12  1230588997824499712          1
4              12  1230585396238655494          1
...           ...                  ...        ...
367863  565337082  1228209607824179200          1
367864  565337082  1228187177973977095          1
367865  565337082  1228186762473684993          1
367866  566386538   366746707637194752          1
367867  568770231   197502090778640384          1

[367868 rows x 3 columns]

In [23]:
 new_df['user_id'].nunique(), new_df['tweet_id'].nunique()

(10419, 177558)

In [33]:
df_dummy = pd.read_csv("../../TwitterEgo/data/trust_data.txt",header=None, sep=' ',engine='python')
df_dummy[0].nunique()

25174

In [28]:
df2 = pd.read_csv("../../Epinions/ratings_data.txt",header=None, sep=' ',engine='python')
df2

            0      1  2
0           1    100  4
1           1    101  5
2           1    102  3
3           1     10  3
4           1    103  5
...       ...    ... ..
664819  49289  30791  5
664820  49289   3862  4
664821  49289   3939  5
664822  49289  60213  4
664823  49289  62722  4

[664824 rows x 3 columns]

In [29]:
df2[0].nunique(), df2[1].nunique()

(40163, 139738)

In [25]:
df2_dummy = pd.read_csv("../../Epinions/trust_data.txt",header=None, sep=' ')
df2_dummy

         0      1      2  3
0      NaN  22605  42915  1
1      NaN  22605   5052  1
2      NaN  22605  42913  1
3      NaN  22605  18420  1
4      NaN  22605  42914  1
...     ..    ...    ... ..
487178 NaN  36960   5808  1
487179 NaN  36960   1056  1
487180 NaN  36960    422  1
487181 NaN  36960    804  1
487182 NaN  36960  12784  1

[487183 rows x 4 columns]

In [21]:
df3 = pd.read_csv("../../FilmTrust/ratings.txt",header=None, sep=' ')
df3
df3[0].nunique(), df3[1].nunique()

(1508, 2071)

In [35]:
df3

          0    1    2
0         1    1  2.0
1         1    2  4.0
2         1    3  3.5
3         1    4  3.0
4         1    5  4.0
...     ...  ...  ...
35492  1508   84  3.5
35493  1508   17  4.0
35494  1508  669  1.0
35495  1508  686  2.5
35496  1508  806  3.5

[35497 rows x 3 columns]

In [34]:
df3_dummy = pd.read_csv("../../FilmTrust/trust.txt",header=None, sep=' ')
df3_dummy

         0     1  2
0        2   966  1
1        2   104  1
2        5  1509  1
3        6  1192  1
4        7  1510  1
...    ...   ... ..
1848  1507   806  1
1849  1507   361  1
1850  1508  1187  1
1851  1508   509  1
1852  1508   938  1

[1853 rows x 3 columns]

In [22]:
df4 = pd.read_csv("../../CiaoDVD/ratings_data.txt",header=None, sep=' ')
df4
df4[0].nunique(), df4[1].nunique()

(17615, 16121)

In [50]:
df.to_csv(data_path+'ratings_data.txt', header=None, index=None, sep=' ', mode='a')

In [63]:
import numpy as np
from sklearn.model_selection import StratifiedShuffleSplit
X = np.array([new_df['user_id'],new_df['tweet_id']]).T
y = np.array([new_df['did_react']]).T

In [65]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=0, stratify=y)

In [76]:
X_train.shape, y_train.shape, X_test.shape, y_test.shape

((257507, 2), (257507, 1), (110361, 2), (110361, 1))

In [84]:
train = pd.DataFrame(X_train,columns = ['user_id','tweet_id'])

In [86]:
train['did_react'] = pd.DataFrame(y_train)

In [89]:
train['did_react'].value_counts()

0    129208
1    128299
Name: did_react, dtype: int64

In [90]:
test = pd.DataFrame(X_test,columns = ['user_id','tweet_id'])
test['did_react'] = pd.DataFrame(y_test)
test['did_react'].value_counts()

0    55376
1    54985
Name: did_react, dtype: int64

In [91]:
train.to_csv(data_path+'trainset.txt', header=None, index=None, sep=' ', mode='a')
test.to_csv(data_path+'testset.txt', header=None, index=None, sep=' ', mode='a')

In [92]:
len(train),len(test)

(257507, 110361)